# Working with datetime in Pandas DataFrame

<img src="images/datetimememe.webp">

In [2]:
import pandas as pd

### 1. Convert strings to datetime

#### Default arguments

In [4]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

In [5]:
df

        date  value
0  3/10/2000      2
1  3/11/2000      3
2  3/12/2000      4

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   value   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [7]:
df['date'] = pd.to_datetime(df['date'])

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      datetime64[ns]
 1   value   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 180.0 bytes

In [ ]:
df

# yyyy-mm-dd

        date  value
0 2000-03-10      2
1 2000-03-11      3
2 2000-03-12      4

#### Day first format

In [10]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'], dayfirst=True)

In [11]:
df

        date  value
0 2000-10-03      2
1 2000-11-03      3
2 2000-12-03      4

#### Custom format 

Ref - https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html

In [ ]:
# dd: 01,02,03,...,31
# d: 1,...31

# mm: 01,02,03,...,12
# m: 1,...12

In [12]:
# yyyy-m-dd
df = pd.DataFrame({'date': ['2016-6-10 20:30:0', 
                            '2016-7-1 19:45:30', 
                            '2013-10-12 4:5:1'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'], format="%Y-%d-%m %H:%M:%S")

In [ ]:
# Parse

In [13]:
df

                 date  value
0 2016-10-06 20:30:00      2
1 2016-01-07 19:45:30      3
2 2013-12-10 04:05:01      4

In [15]:
df = pd.DataFrame({'date': ['2016-6-10 20:30:0.123', 
                            '2016-7-1 19:45:30.456789', 
                            '2013-10-12 4:5:1.45'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'], format="%Y-%d-%m %H:%M:%S.%f")

In [16]:
df

                        date  value
0 2016-10-06 20:30:00.123000      2
1 2016-01-07 19:45:30.456789      3
2 2013-12-10 04:05:01.450000      4

In [14]:
df.dtypes

date     datetime64[ns]
value             int64
dtype: object

#### Speedup parsing with infer_datetime_format

In [17]:
df = pd.DataFrame({'date': ['3/11/2000', '3/12/2000', '3/13/2000'] * 1000 })
df.head()

        date
0  3/11/2000
1  3/12/2000
2  3/13/2000
3  3/11/2000
4  3/12/2000

In [18]:
pd.to_datetime(df['date'], infer_datetime_format=True)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_22600\2393293147.py:1: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  pd.to_datetime(df['date'], infer_datetime_format=True)

0      2000-03-11
1      2000-03-12
2      2000-03-13
3      2000-03-11
4      2000-03-12
          ...
2995   2000-03-12
2996   2000-03-13
2997   2000-03-11
2998   2000-03-12
2999   2000-03-13
Name: date, Length: 3000, dtype: datetime64[ns]

#### Handle parsing error

In [19]:
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

In [20]:
df

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [21]:
df['date'] = pd.to_datetime(df['date'])

ValueError: time data "a/11/2000" doesn't match format "%m/%d/%Y", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [22]:
df['date'] = pd.to_datetime(df['date'], errors='ignore')
df

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_22600\3639693634.py:1: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_datetime without passing `errors` and catch exceptions explicitly instead
  df['date'] = pd.to_datetime(df['date'], errors='ignore')

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [23]:
df.dtypes

date     object
value     int64
dtype: object

In [24]:
df['date'] = pd.to_datetime(df['date'], errors='coerce')
df

        date  value
0 2000-03-10      2
1        NaT      3
2 2000-03-12      4

### 2. Assemble a datetime from multiple columns

In [25]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})

In [26]:
df

   year  month  day
0  2015      2    4
1  2016      3    5

In [27]:

df['date'] = pd.to_datetime(df)

In [28]:
df

   year  month  day       date
0  2015      2    4 2015-02-04
1  2016      3    5 2016-03-05

### 3. Get year, month and day

In [29]:
df = pd.DataFrame({'name': ['Tom', 'Andy', 'Lucas'],
                 'DoB': ['08-05-1997', '04-28-1996', '12-16-1995']})

In [30]:
df

    name         DoB
0    Tom  08-05-1997
1   Andy  04-28-1996
2  Lucas  12-16-1995

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   DoB     3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

In [32]:
df['DoB'] = pd.to_datetime(df['DoB'])

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   DoB     3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 180.0+ bytes

In [34]:
df['year']= df['DoB'].dt.year
df['month']= df['DoB'].dt.month
df['day']= df['DoB'].dt.day
df

    name        DoB  year  month  day
0    Tom 1997-08-05  1997      8    5
1   Andy 1996-04-28  1996      4   28
2  Lucas 1995-12-16  1995     12   16

### 4. Get the week of year, the day of week and leap year

In [36]:
df['weekday'] = df['DoB'].dt.weekday
df['day_of_week'] = df['DoB'].dt.dayofweek
df['is_leap_year'] = df['DoB'].dt.is_leap_year
df

    name        DoB  year  month  day  weekday  day_of_week  is_leap_year
0    Tom 1997-08-05  1997      8    5        1            1         False
1   Andy 1996-04-28  1996      4   28        6            6          True
2  Lucas 1995-12-16  1995     12   16        5            5         False

In [37]:
df['DoB'].dt.weekday

0    1
1    6
2    5
Name: DoB, dtype: int32

## Map & Apply

* Use map when working with a single Series and performing element-wise transformations.
* Use apply when you need to work row-wise or column-wise on a DataFrame, or perform more complex operations.

In [38]:
df

    name        DoB  year  month  day  weekday  day_of_week  is_leap_year
0    Tom 1997-08-05  1997      8    5        1            1         False
1   Andy 1996-04-28  1996      4   28        6            6          True
2  Lucas 1995-12-16  1995     12   16        5            5         False

In [42]:
def convert_weekday(number):
    dw_mapping={
        0: 'Monday', 
        1: 'Tuesday', 
        2: 'Wednesday', 
        3: 'Thursday', 
        4: 'Friday',
        5: 'Saturday', 
        6: 'Sunday'
    } 

    return dw_mapping[number]

In [43]:
df["day_name_of_week"] = df["weekday"].map(lambda x: convert_weekday(x))

In [44]:
df

,name,DoB,year,month,day,weekday,day_of_week,is_leap_year,day_name_of_week
0,Tom,1997-08-05,1997,8,5,1,1,False,Tuesday
1,Andy,1996-04-28,1996,4,28,6,6,True,Sunday
2,Lucas,1995-12-16,1995,12,16,5,5,False,Saturday

In [45]:
df["day_name_of_week_apply"] = df["weekday"].apply(lambda x: convert_weekday(x))

In [46]:
df

,name,DoB,year,month,day,weekday,day_of_week,is_leap_year,day_name_of_week,day_name_of_week_apply
0,Tom,1997-08-05,1997,8,5,1,1,False,Tuesday,Tuesday
1,Andy,1996-04-28,1996,4,28,6,6,True,Sunday,Sunday
2,Lucas,1995-12-16,1995,12,16,5,5,False,Saturday,Saturday

In [47]:
df["day_name_of_week_for_loop"] = [convert_weekday(x) for x in df["weekday"]]

In [48]:
df

,name,DoB,year,month,day,weekday,day_of_week,is_leap_year,day_name_of_week,day_name_of_week_apply,day_name_of_week_for_loop
0,Tom,1997-08-05,1997,8,5,1,1,False,Tuesday,Tuesday,Tuesday
1,Andy,1996-04-28,1996,4,28,6,6,True,Sunday,Sunday,Sunday
2,Lucas,1995-12-16,1995,12,16,5,5,False,Saturday,Saturday,Saturday

In [51]:
def check_value(year, month):
    if year > 1996 and month < 10:
        return "1"
    else: 
        return "0"

In [53]:
df['check_value'] = df.apply(lambda x: check_value(year = x['year'], month = x['month']), axis=1)

In [54]:
df

,name,DoB,year,month,day,weekday,day_of_week,is_leap_year,day_name_of_week,day_name_of_week_apply,day_name_of_week_for_loop,check_value
0,Tom,1997-08-05,1997,8,5,1,1,False,Tuesday,Tuesday,Tuesday,1
1,Andy,1996-04-28,1996,4,28,6,6,True,Sunday,Sunday,Sunday,0
2,Lucas,1995-12-16,1995,12,16,5,5,False,Saturday,Saturday,Saturday,0

In [55]:
dw_mapping={
    0: 'Monday', 
    1: 'Tuesday', 
    2: 'Wednesday', 
    3: 'Thursday', 
    4: 'Friday',
    5: 'Saturday', 
    6: 'Sunday'
} 
df['day_of_week_name']=df['DoB'].dt.weekday.map(dw_mapping)
df

,name,DoB,year,month,day,weekday,day_of_week,is_leap_year,day_name_of_week,day_name_of_week_apply,day_name_of_week_for_loop,check_value,day_of_week_name
0,Tom,1997-08-05,1997,8,5,1,1,False,Tuesday,Tuesday,Tuesday,1,Tuesday
1,Andy,1996-04-28,1996,4,28,6,6,True,Sunday,Sunday,Sunday,0,Sunday
2,Lucas,1995-12-16,1995,12,16,5,5,False,Saturday,Saturday,Saturday,0,Saturday

### 5. Get the age from the date of birth

In [ ]:
# Scalar: gi tr n
pd.to_datetime('today').year

2024

In [58]:
pd.to_datetime('today').year - df['DoB'].dt.year

0    27
1    28
2    29
Name: DoB, dtype: int32

In [61]:
today = pd.to_datetime('today')
df['age'] = today.year - df['DoB'].dt.year

df

,name,DoB,year,month,day,weekday,day_of_week,is_leap_year,day_name_of_week,day_name_of_week_apply,day_name_of_week_for_loop,check_value,day_of_week_name,age
0,Tom,1997-08-05,1997,8,5,1,1,False,Tuesday,Tuesday,Tuesday,1,Tuesday,27
1,Andy,1996-04-28,1996,4,28,6,6,True,Sunday,Sunday,Sunday,0,Sunday,28
2,Lucas,1995-12-16,1995,12,16,5,5,False,Saturday,Saturday,Saturday,0,Saturday,29

In [ ]:
# Year difference
today = pd.to_datetime('today')
diff_y = today.year - df['DoB'].dt.year


# Haven't had birthday
b_md = df['DoB'].apply(lambda x: (x.month,x.day) )
no_birthday = b_md > (today.month,today.day)

df['age'] = diff_y - no_birthday
df

In [ ]:
no_birthday

### 6. Improve performance by setting date column as the index

In [62]:
df = pd.read_csv('data/city_sales.csv',parse_dates=['date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376433 entries, 0 to 376432
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    376433 non-null  datetime64[ns]
 1   num     376433 non-null  int64
 2   city    376433 non-null  object
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 8.6+ MB

In [63]:
df = df.set_index(['date'])

In [64]:
df

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[376433 rows x 2 columns]

### 7. Select data with a specific year and perform aggregation

In [65]:
df.loc['2018']

                     num    city
date
2018-01-01 09:00:00    2  London
2018-01-01 09:01:00    1  London
2018-01-01 09:02:00    3  London
2018-01-01 09:03:00    3  London
2018-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[47211 rows x 2 columns]

In [66]:
df.loc['2018','num'].sum()

np.int64(132127)

In [ ]:
df['2018'].groupby('city').sum()

### 8. Select data with a specific month or a specific day of the month

In [ ]:
df.loc['2018-5']

In [ ]:
df.loc['2018-5-1']

In [65]:
cond = df.index.month==3

In [ ]:
cond

In [ ]:
df[cond]

In [ ]:
cond = df.index.month==2
df[cond]

### 9. Select data between two dates

In [ ]:
df.loc['2016' : '2018']

In [ ]:
df.loc['2018-5-2 10' : '2018-5-2 11' ]

In [ ]:
df.loc['2018-5-2 10:30' : '2018-5-2 10:45' ]

In [ ]:
df.between_time('10:30','10:45')

In [ ]:
df['rolling_sum_backfilled'] = df['rolling_sum'].fillna(method='backfill')
df.head()